MohamedElAzhary/STM32F303RE_MCAL/Defines/STM32F303RET6.h
/*****************************************************************************/
// FileName     : STM32F303RET6.h
// Author       : Mohamed ElAzhary
// Description  : This file contains STM32F303RET6 definitions
//
//
/*****************************************************************************/
#ifndef _STM_H_
#define _STM_H_

/*******************************File-Includes*********************************/
#include "stdint.h"
/*****************************************************************************/

/**********************************Macros*************************************/
#define STD_ON		(1U)
#define STD_OFF		(2U)

/******************************************************************************/
/*                                                                            */
/*                               Memory Mapping                               */
/*                                                                            */
/******************************************************************************/

#define FLASH_BASE            ((uint32_t)0x08000000) /*!< FLASH base address in the alias region */
#define CCM_RAM_BASE          ((uint32_t)0x10000000) /*!< CCM RAM base address in the alias region */
#define SYSTEM_MEMORY_BASE    ((uint32_t)0x1FFFD800) /*!< System Memory base address in the alias region */
#define OPTION_BYTES_BASE     ((uint32_t)0x1FFFF800) /*!< Option bytes base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000) /*!< SRAM base address in the alias region */

#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< Peripheral base address in the alias region */


#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the bit-band region */


#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)
#define AHB3PERIPH_BASE       (PERIPH_BASE + 0x10000000)



/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O (PORT)                      */
/*                                                                            */
/******************************************************************************/
/*******************  Reset values for PORT_REG_PORTx registers   *****************/


/* Ports Base Addresses */
#define PORT_REG_PORT_A_BASE_REG   ((uint32_t) 0x48000000 )
#define PORT_REG_PORT_B_BASE_REG   ((uint32_t) 0x48000400 )
#define PORT_REG_PORT_C_BASE_REG   ((uint32_t) 0x48000800 )
#define PORT_REG_PORT_D_BASE_REG   ((uint32_t) 0x48000C00 )
#define PORT_REG_PORT_E_BASE_REG   ((uint32_t) 0x48001000 )
#define PORT_REG_PORT_F_BASE_REG   ((uint32_t) 0x48001400 )
#define PORT_REG_PORT_G_BASE_REG   ((uint32_t) 0x48001800 )
#define PORT_REG_PORT_H_BASE_REG   ((uint32_t) 0x48001C00 )

/* Ports Offset Addresses */
#define PORT_REG_MODER_OFFSET		   ((uint32_t) 0x00000000)
#define PORT_REG_OTYPER_OFFSET		   ((uint32_t) 0x00000004)
#define PORT_REG_OSPEEDR_OFFSET		   ((uint32_t) 0x00000008)
#define PORT_REG_PUPDR_OFFSET		   ((uint32_t) 0x0000000C)
#define PORT_REG_IDR_OFFSET		   	   ((uint32_t) 0x00000010)
#define PORT_REG_ODR_OFFSET		   	   ((uint32_t) 0x00000014)
#define PORT_REG_BSRR_OFFSET		   ((uint32_t) 0x00000018)
#define PORT_REG_LCKR_OFFSET		   ((uint32_t) 0x0000001C)
#define PORT_REG_BSRR_OFFSET		   ((uint32_t) 0x00000018)
#define PORT_REG_AFRL_OFFSET		   ((uint32_t) 0x00000020)
#define PORT_REG_AFRH_OFFSET		   ((uint32_t) 0x00000024)
#define PORT_REG_BRR_OFFSET		   	   ((uint32_t) 0x00000028)

/* Port MODER Registers addresses */
#define PORT_REG_PORT_A_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_B_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_C_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_D_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_E_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_F_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_G_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_MODER_OFFSET )))
#define PORT_REG_PORT_H_MODER		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_MODER_OFFSET )))

/* Port OTYPER Registers addresses */
#define PORT_REG_PORT_A_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_B_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_C_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_D_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_E_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_F_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_G_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_OTYPER_OFFSET )))
#define PORT_REG_PORT_H_OTYPER		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_OTYPER_OFFSET )))

/* Port OSPEEDR Registers addresses */
#define PORT_REG_PORT_A_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_B_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_C_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_D_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_E_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_F_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_G_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))
#define PORT_REG_PORT_H_OSPEEDR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_OSPEEDR_OFFSET )))

/* Port PUPDR Registers addresses */
#define PORT_REG_PORT_A_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_B_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_C_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_D_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_E_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_F_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_G_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_PUPDR_OFFSET )))
#define PORT_REG_PORT_H_PUPDR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_PUPDR_OFFSET )))

/* Port IDR Registers addresses */
#define PORT_REG_PORT_A_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_B_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_C_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_D_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_E_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_F_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_G_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_IDR_OFFSET )))
#define PORT_REG_PORT_H_IDR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_IDR_OFFSET )))

/* Port ODR Registers addresses */
#define PORT_REG_PORT_A_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_B_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_C_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_D_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_E_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_F_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_G_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_ODR_OFFSET )))
#define PORT_REG_PORT_H_ODR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_ODR_OFFSET )))

/* Port BSRR Registers addresses */
#define PORT_REG_PORT_A_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_B_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_C_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_D_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_E_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_F_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_G_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_H_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_BSRR_OFFSET )))

