MohamedElAzhary/STM32F303RE_MCAL/Defines/STM32F303RET6.h
/* Port LCKR Registers addresses */
#define PORT_REG_PORT_A_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_B_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_C_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_D_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_E_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_F_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_G_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_LCKR_OFFSET )))
#define PORT_REG_PORT_H_LCKR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_LCKR_OFFSET )))

/* Port BSRR Registers addresses */
#define PORT_REG_PORT_A_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_B_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_C_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_D_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_E_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_F_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_G_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_BSRR_OFFSET )))
#define PORT_REG_PORT_H_BSRR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_BSRR_OFFSET )))

/* Port AFRL Registers addresses */
#define PORT_REG_PORT_A_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_B_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_C_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_D_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_E_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_F_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_G_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_AFRL_OFFSET )))
#define PORT_REG_PORT_H_AFRL		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_AFRL_OFFSET )))

/* Port AFRH Registers addresses */
#define PORT_REG_PORT_A_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_B_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_C_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_D_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_E_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_F_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_G_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_AFRH_OFFSET )))
#define PORT_REG_PORT_H_AFRH		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_AFRH_OFFSET )))

/* Port BRR Registers addresses */
#define PORT_REG_PORT_A_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_A_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_B_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_B_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_C_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_C_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_D_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_D_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_E_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_E_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_F_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_F_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_G_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_G_BASE_REG + PORT_REG_BRR_OFFSET )))
#define PORT_REG_PORT_H_BRR		(*((volatile uint32_t*)( PORT_REG_PORT_H_BASE_REG + PORT_REG_BRR_OFFSET )))



/*******************  Bit definition for PORT_REG_MODER register  *****************/
#define PORT_REG_MODER_BITS_MASK	   ((uint32_t)0x00000003)
#define PORT_REG_MODER_MODER0_0        ((uint32_t)0x00000000)
#define PORT_REG_MODER_MODER1_0        ((uint32_t)0x00000002)
#define PORT_REG_MODER_MODER2_0        ((uint32_t)0x00000004)
#define PORT_REG_MODER_MODER3_0        ((uint32_t)0x00000006)
#define PORT_REG_MODER_MODER4_0        ((uint32_t)0x00000008)
#define PORT_REG_MODER_MODER5_0        ((uint32_t)0x0000000A)
#define PORT_REG_MODER_MODER6_0        ((uint32_t)0x0000000C)
#define PORT_REG_MODER_MODER7_0        ((uint32_t)0x0000000E)
#define PORT_REG_MODER_MODER8_0        ((uint32_t)0x00000010)
#define PORT_REG_MODER_MODER9_0        ((uint32_t)0x00000012)
#define PORT_REG_MODER_MODER10_0       ((uint32_t)0x00000014)
#define PORT_REG_MODER_MODER11_0       ((uint32_t)0x00000016)
#define PORT_REG_MODER_MODER12_0       ((uint32_t)0x00000018)
#define PORT_REG_MODER_MODER13_0       ((uint32_t)0x0000001A)
#define PORT_REG_MODER_MODER14_0       ((uint32_t)0x0000001C)
#define PORT_REG_MODER_MODER15_0       ((uint32_t)0x0000001E)


/******************  Bit definition for PORT_REG_OTYPER register  *****************/
#define PORT_REG_OTYPER_BITS_MASK	     ((uint32_t)0x00000001)
#define PORT_REG_OTYPER_OTYPER0_0        ((uint32_t)0x00000000)
#define PORT_REG_OTYPER_OTYPER1_0        ((uint32_t)0x00000001)
#define PORT_REG_OTYPER_OTYPER2_0        ((uint32_t)0x00000002)
#define PORT_REG_OTYPER_OTYPER3_0        ((uint32_t)0x00000003)
#define PORT_REG_OTYPER_OTYPER4_0        ((uint32_t)0x00000004)
#define PORT_REG_OTYPER_OTYPER5_0        ((uint32_t)0x00000005)
#define PORT_REG_OTYPER_OTYPER6_0        ((uint32_t)0x00000006)
#define PORT_REG_OTYPER_OTYPER7_0        ((uint32_t)0x00000007)
#define PORT_REG_OTYPER_OTYPER8_0        ((uint32_t)0x00000008)
#define PORT_REG_OTYPER_OTYPER9_0        ((uint32_t)0x00000009)
#define PORT_REG_OTYPER_OTYPER10_0       ((uint32_t)0x0000000A)
#define PORT_REG_OTYPER_OTYPER11_0       ((uint32_t)0x0000000B)
#define PORT_REG_OTYPER_OTYPER12_0       ((uint32_t)0x0000000C)
#define PORT_REG_OTYPER_OTYPER13_0       ((uint32_t)0x0000000D)
#define PORT_REG_OTYPER_OTYPER14_0       ((uint32_t)0x0000000E)
#define PORT_REG_OTYPER_OTYPER15_0       ((uint32_t)0x0000000F)

