MohamedElAzhary/STM32F303RE_MCAL/Defines/STM32F303RET6.h
/****************** Bit definition for PORT_REG_LCKR register  ********************/
#define PORT_REG_LCKR_BITS_MASK	     ((uint32_t)0x00000001)
#define PORT_REG_LCKR_LCKR0_0        ((uint32_t)0x00000000)
#define PORT_REG_LCKR_LCKR1_0        ((uint32_t)0x00000001)
#define PORT_REG_LCKR_LCKR2_0        ((uint32_t)0x00000002)
#define PORT_REG_LCKR_LCKR3_0        ((uint32_t)0x00000003)
#define PORT_REG_LCKR_LCKR4_0        ((uint32_t)0x00000004)
#define PORT_REG_LCKR_LCKR5_0        ((uint32_t)0x00000005)
#define PORT_REG_LCKR_LCKR6_0        ((uint32_t)0x00000006)
#define PORT_REG_LCKR_LCKR7_0        ((uint32_t)0x00000007)
#define PORT_REG_LCKR_LCKR8_0        ((uint32_t)0x00000008)
#define PORT_REG_LCKR_LCKR9_0        ((uint32_t)0x00000009)
#define PORT_REG_LCKR_LCKR10_0       ((uint32_t)0x0000000A)
#define PORT_REG_LCKR_LCKR11_0       ((uint32_t)0x0000000B)
#define PORT_REG_LCKR_LCKR12_0       ((uint32_t)0x0000000C)
#define PORT_REG_LCKR_LCKR13_0       ((uint32_t)0x0000000D)
#define PORT_REG_LCKR_LCKR14_0       ((uint32_t)0x0000000E)
#define PORT_REG_LCKR_LCKR15_0       ((uint32_t)0x0000000F)

/****************** Bit definition for PORT_REG_AFRL register  ********************/
#define PORT_REG_AFRL_BITS_MASK          ((uint32_t)0x0000000F)
#define PORT_REG_AFRL_AFRL0_0            ((uint32_t)0x00000000)
#define PORT_REG_AFRL_AFRL1_0            ((uint32_t)0x00000004)
#define PORT_REG_AFRL_AFRL2_0            ((uint32_t)0x00000008)
#define PORT_REG_AFRL_AFRL3_0            ((uint32_t)0x0000000C)
#define PORT_REG_AFRL_AFRL4_0            ((uint32_t)0x00000010)
#define PORT_REG_AFRL_AFRL5_0            ((uint32_t)0x00000014)
#define PORT_REG_AFRL_AFRL6_0            ((uint32_t)0x00000018)
#define PORT_REG_AFRL_AFRL7_0            ((uint32_t)0x0000001C)

/****************** Bit definition for PORT_REG_AFRH register  ********************/
#define PORT_REG_AFRH_BITS_MASK          ((uint32_t)0x0000000F)
#define PORT_REG_AFRH_AFRH0_0            ((uint32_t)0x00000000)
#define PORT_REG_AFRH_AFRH1_0            ((uint32_t)0x00000004)
#define PORT_REG_AFRH_AFRH2_0            ((uint32_t)0x00000008)
#define PORT_REG_AFRH_AFRH3_0            ((uint32_t)0x0000000C)
#define PORT_REG_AFRH_AFRH4_0            ((uint32_t)0x00000010)
#define PORT_REG_AFRH_AFRH5_0            ((uint32_t)0x00000014)
#define PORT_REG_AFRH_AFRH6_0            ((uint32_t)0x00000018)
#define PORT_REG_AFRH_AFRH7_0            ((uint32_t)0x0000001C)


/****************** Bit definition for PORT_REG_BRR register  *********************/
#define PORT_REG_BRR_BITS_MASK	   ((uint32_t)0x00000001)
#define PORT_REG_BRR_BRR0_0        ((uint32_t)0x00000000)
#define PORT_REG_BRR_BRR1_0        ((uint32_t)0x00000001)
#define PORT_REG_BRR_BRR2_0        ((uint32_t)0x00000002)
#define PORT_REG_BRR_BRR3_0        ((uint32_t)0x00000003)
#define PORT_REG_BRR_BRR4_0        ((uint32_t)0x00000004)
#define PORT_REG_BRR_BRR5_0        ((uint32_t)0x00000005)
#define PORT_REG_BRR_BRR6_0        ((uint32_t)0x00000006)
#define PORT_REG_BRR_BRR7_0        ((uint32_t)0x00000007)
#define PORT_REG_BRR_BRR8_0        ((uint32_t)0x00000008)
#define PORT_REG_BRR_BRR9_0        ((uint32_t)0x00000009)
#define PORT_REG_BRR_BRR10_0       ((uint32_t)0x0000000A)
#define PORT_REG_BRR_BRR11_0       ((uint32_t)0x0000000B)
#define PORT_REG_BRR_BRR12_0       ((uint32_t)0x0000000C)
#define PORT_REG_BRR_BRR13_0       ((uint32_t)0x0000000D)
#define PORT_REG_BRR_BRR14_0       ((uint32_t)0x0000000E)
#define PORT_REG_BRR_BRR15_0       ((uint32_t)0x0000000F)

#define RCC_REG_RCC_BASE_REG       ((uint32_t)0x40021000)
#define RCC_REG_AHBENR_OFFSET	   ((uint32_t)0x00000014)
#define RCC_REG_AHBENR   	       (*((volatile uint32_t*)( RCC_REG_RCC_BASE_REG + RCC_REG_AHBENR_OFFSET )))

/*****************************************************************************/

/*******************************Global-Variables******************************/

/*****************************************************************************/

/*****************************Function-Prototypes*****************************/

/*****************************************************************************/

/*****************************Function-Definitions****************************/

/*****************************************************************************/

#endif /* End of #ifndef */
